# Top Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexIndexPair..::..Top Property
VertexIndexPair Class See Also
---
The index of the vertex pair from the top profile.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public int Top { get; set; }
```

Visual Basic
---
```text
Public Property Top As Integer
	Get
	Set
```

Visual C++
---
```text
public:
property int Top {
	int get ();
	void set (int value);
}
```

# See Also
VertexIndexPair Class
Autodesk.Revit.DB Namespace